/*********************************************************************************************** 
** Author        : DengXiaoJun(邓小俊)
** Date          : 2023-08-29 14:07:30 +0800
** Description   : When I Has Time ,I Will Write Description Below:
** ModifyRecord1 :    
** ModifyRecord2 :    
** LastEditors   : DengXiaoJun(邓小俊)
** LastEditTime  : 2023-11-22 13:34:16 +0800
************************************************************************************************/ 
#include "SysParamDefault.h"


//磁珠针默认参数
const SYS_PARAM_NEEDLE_BEAD needleBeadParamDefault = {
    -312,//磁珠针旋转零位修正
    0,//磁珠针升降零位修正
    -312,//磁珠针旋转到清洗位坐标
    1080,//磁珠针升降到清洗位坐标
    -660,//磁珠针旋转到R1坐标
    3110,//磁珠针升降R1吸样探液极限点
    -804,//磁珠针旋转到R2坐标
    3110,//磁珠针升降R2吸样探液极限点
    -1074,//磁珠针旋转到磁珠位坐标
    2080,//磁珠针升降磁珠位吸样探液极限点
    289,//磁珠针旋转到反应盘排样坐标
    1420,//磁珠针升降反应盘排样杯底高度
    1420,//磁珠针升降反应盘排样修正高度
    20,//磁珠针清洗完吸空气量
    30,//磁珠针吸样完吸空气量
    25,//磁珠针注液保留空气量
    1,//磁珠针探液通讯使能
    0,//磁珠针泵齿间差
    0,//小磁珠吸吐混匀高度
    0,//探液板版本号回填确认
    {0},//保留的参数,程序稳定后增加参数就从这个数组大小中减少参数,防止参数错位
};

//试剂盘默认参数
const SYS_PARAM_PLATE_REAGENT plateReagentParamDefault = {
    8035,//试剂盘零位修正
    0,//试剂盘相对试剂针到R1偏移
    1685,//试剂盘相对试剂针到R2偏移
    -1480,//试剂盘相对磁珠针到R1偏移
    -1860,//试剂盘相对磁珠针到R2偏移
    -3200,//试剂盘相对磁珠针到磁珠偏移
    6935,//试剂盘到扫码位偏移
    {0},//保留的参数,程序稳定后增加参数就从这个数组大小中减少参数,防止参数错位
};


//杯栈管理参数
const SYS_PARAM_CUP_TRAY_MANAGE cupTrayManageParamDefault = {
    0,//新杯盘升降电机零位修正
    0,//空杯盘升降电机零位修正
    -45,//夹手电机零位修正
    -200,//推杆电机零位修正
    -260,//夹手打开坐标
    60,//夹手关闭坐标
    5200,//推杆推新盘到测试位坐标
    1750,//新杯栈满时,顶部到检测位偏移
    3300,//新杯栈满时,顶部到平台偏移
    1056,//新杯栈上升一个杯盘的偏移
    0,//空杯栈满时,顶部到检测位偏移
    1650,//空杯栈满时,顶部到承接平台偏移
    1056,//空杯栈上升一个杯盘的偏移
    {0},//保留的参数,程序稳定后增加参数就从这个数组大小中减少参数,防止参数错位
};

//辅助参数
const SYS_PARAM_OTHER otherUtilParamDefault = {
  0,//辅助参数
  {0},//保留的参数,程序稳定后增加参数就从这个数组大小中减少参数,防止参数错位
};
