/*********************************************************************************************** 
** Author        : DengXiaoJun(邓小俊)
** Date          : 2023-08-29 14:07:30 +0800
** Description   : When I Has Time ,I Will Write Description Below:
** ModifyRecord1 :    
** ModifyRecord2 :    
** LastEditors   : DengXiaoJun(邓小俊)
** LastEditTime  : 2023-12-18 14:28:41 +0800
************************************************************************************************/ 
#include "SysParamDefault.h"

//新杯机械手参数参数集合
const SYS_PARAM_HAND_NEW_CUP handNewCupParamDefault = {
    0,//新杯机械手升降零位修正
    16,//新杯机械手左右零位修正
    34,//新杯机械手前后零位修正
    34,//新杯机械手前后新杯盘1号孔坐标
    16,//新杯机械手左右新杯盘1号孔坐标
    3057,//新杯机械手前后新杯盘140号孔坐标
    4831,//新杯机械手左右新杯盘140号孔坐标
    1705,//新杯机械手升降新杯盘取杯坐标
    6706,//新杯机械手前后反应盘坐标
    5770,//新杯机械手左右反应盘坐标
    1740,//新杯机械手升降反应盘取杯坐标
    1660,//新杯机械手升降反应盘放杯坐标
    6000,//新杯机械手前后垃圾桶1坐标
    4155,//新杯机械手左右垃圾桶1坐标
    2480,//新杯机械手升降垃圾桶1丢杯坐标
    6000,//新杯机械手前后垃圾桶2坐标
    660,//新杯机械手左右垃圾桶2坐标
    2500,//新杯机械手升降垃圾桶2丢杯坐标
    {0},//保留参数      
};


//样本针参数集合
const SYS_PARAM_NEEDLE_SAMPLE needleSampleParamDefault = {
    -6,//样本针旋转零位修正
    0,//样本针升降零位修正
    -100,//样本针旋转到强洗位坐标
    1200,//样本针升降到强洗位坐标
    1000,//样本针强洗时间,置换强洗液,毫秒
    5000,//样本针强洗液灌注时间,毫秒
    -6,//样本针旋转到清洗位
    1270,//样本针升降到清洗位坐标
    1254,//样本针旋转到试管架吸样位坐标
    1200,//样本针吸液样本架平面高度
    3240,//样本针吸样探液极限点,试管类型1
    2000,//样本针吸样探液极限点,试管类型2
    1200,//样本针吸样探液起始点,试管类型3
    1200,//样本针吸样探液起始点,试管类型4
    2000,//样本针吸样探液极限点,试管类型4
    2000,//样本针吸样探液极限点,试管类型5
    2000,//样本针吸样探液极限点,试管类型6
    2000,//样本针吸样探液极限点,试管类型7
    2000,//样本针吸样探液极限点,试管类型8
    -580,//样本针旋转到反应盘吸液坐标
    1630,//样本针升降反应盘吸液杯底高度
    50,//样本针升降反应盘吸液修正高度
    -1390,//样本针旋转到反应盘注液坐标
    1600,//样本针升降到反应盘注液杯底高度
    1600,//样本针升降到反应盘注液修正高度
    20,//样本针清洗完吸空气量
    20,//样本针吸样完吸空气量
    20,//样本针注液保留空气量
    1,//样本针探液通讯使能
    0,//样本针旋转到急诊吸样位
    0,//样本针泵版本，0：250ul2000步，1：250ul4000步
    {0},//保留参数      
};

//其余辅助参数集合
const SYS_PARAM_OTHER otherParamDefault = {
    0,//预留参数,现在没用
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数         
};


