/*********************************************************************************************** 
** Author        : DengXiaoJun(邓小俊)
** Date          : 2023-08-29 14:07:30 +0800
** Description   : When I Has Time ,I Will Write Description Below:
** ModifyRecord1 :    
** ModifyRecord2 :    
** LastEditors   : DengXiaoJun(邓小俊)
** LastEditTime  : 2023-12-06 15:34:43 +0800
************************************************************************************************/ 
#include "SysParamDefault.h"

//反应盘参数
const SYS_PARAM_PLATE_REACTION paramPlateReactionDefault = {
    -30,//反应盘零位修正
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数    
};

//磁珠摇匀参数
const SYS_PARAM_MIX_BEAD paramMixBeadDefault = {
    -100,//磁珠混匀升降零位修正
    0,//磁珠混匀旋转零位修正
    1830,//磁珠混匀模式1升降高度
    3600,//磁珠混匀模式1摇匀时间,毫秒
    1830,//磁珠混匀模式2升降高度
    3600,//磁珠混匀模式2摇匀时间,毫秒
    1830,//磁珠混匀模式3升降高度
    3600,//磁珠混匀模式3摇匀时间,毫秒
    1830,//磁珠混匀模式4升降高度
    3600,//磁珠混匀模式4摇匀时间,毫秒
    1830,//磁珠混匀模式5升降高度
    3600,//磁珠混匀模式5摇匀时间,毫秒
    1830,//磁珠混匀模式6升降高度
    3600,//磁珠混匀模式6摇匀时间,毫秒
    1830,//磁珠混匀模式7升降高度
    3600,//磁珠混匀模式7摇匀时间,毫秒
    1830,//磁珠混匀模式8升降高度
    3600,//磁珠混匀模式8摇匀时间,毫秒
    1830,//磁珠混匀模式9升降高度
    3600,//磁珠混匀模式9摇匀时间,毫秒
    1830,//磁珠混匀模式10升降高度
    3600,//磁珠混匀模式10摇匀时间,毫秒
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数    
};

//试剂摇匀参数
const SYS_PARAM_MIX_REAGENT paramMixReagentDefault = {
    0,//试剂混匀升降零位修正
    0,//试剂混匀旋转零位修正
    1900,//试剂混匀模式1升降高度
    3600,//试剂混匀模式1摇匀时间,毫秒
    1900,//试剂混匀模式2升降高度
    3600,//试剂混匀模式2摇匀时间,毫秒
    1900,//试剂混匀模式3升降高度
    3600,//试剂混匀模式3摇匀时间,毫秒
    1900,//试剂混匀模式4升降高度
    3600,//试剂混匀模式4摇匀时间,毫秒
    1900,//试剂混匀模式5升降高度
    3600,//试剂混匀模式5摇匀时间,毫秒
    1900,//试剂混匀模式6升降高度
    3600,//试剂混匀模式6摇匀时间,毫秒
    1900,//试剂混匀模式7升降高度
    3600,//试剂混匀模式7摇匀时间,毫秒
    1900,//试剂混匀模式8升降高度
    3600,//试剂混匀模式8摇匀时间,毫秒
    1900,//试剂混匀模式9升降高度
    3600,//试剂混匀模式9摇匀时间,毫秒
    1900,//试剂混匀模式10升降高度
    3600,//试剂混匀模式10摇匀时间,毫秒
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数    
};

//试剂针参数
const SYS_PARAM_NEEDLE_REAGENT paramNeedleReagentDefault = {
    330,//试剂针旋转零位修正
    0,//试剂针升降零位修正
    330,//试剂针旋转到清洗位坐标
    1100,//试剂针升降到清洗位坐标
    810,//试剂针旋转到R1坐标
    3020,//试剂针升降R1吸样探液极限点
    1299,//试剂针旋转到R2坐标
    3030,//试剂针升降R2吸样探液极限点
    -210,//试剂针旋转到反应盘排样坐标
    1500,//试剂针升降反应盘排样杯底高度
    20,//试剂针升降反应盘排样修正高度
    20,//试剂针清洗完吸空气量
    20,//试剂针吸样完吸空气量
    20,//试剂针注液保留空气量
    1,//试剂针探液通讯使能
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数    
};

//其余辅助参数
const SYS_PARAM_OTHER paramOtherDefault = {
    0,//预留参数,现在没用
    {0},//保留的参数,程序稳定后每次增加参数都要从这个里面减少一个参数    
};




